.emacs.d/config.org
#+AUTHOR: Sylvain Ribstein
#+TITLE: GNU Emacs Configuration

* table of content                                                    :TOC@3:
- [[#emacs-initialization][Emacs Initialization]]
  - [[#packages-sources][Packages Sources]]
  - [[#use-package][use-package]]
  - [[#delight][delight]]
  - [[#authentification][Authentification]]
  - [[#defaults-values][defaults values]]
  - [[#customization][Customization]]
  - [[#turn-off-menu-toolbar-and-stuff][Turn off menu, toolbar and stuff]]
- [[#advanced-configuration][Advanced Configuration]]
  - [[#auto-completion-company][Auto-Completion =company=]]
  - [[#backups][Backups]]
  - [[#browser-firefox][Browser (Firefox)]]
    - [[#online-search-engine-mode][Online search =engine-mode=]]
  - [[#buffers-ace-window-ibuffer-toggle-window-split][Buffers ==ace-window== ==ibuffer== =toggle-window-split==]]
  - [[#reset-config-when-configorg-changes][reset config when config.org changes]]
  - [[#spelling][Spelling]]
    - [[#fly-spell][Fly Spell]]
  - [[#history][History]]
  - [[#improved-package-menu-paradox][improved package menu =paradox=]]
  - [[#general][General]]
    - [[#aggressive-indent][=aggressive-indent=]]
    - [[#move-text][=move-text=]]
    - [[#rainbow-mode][=rainbow-mode=]]
    -  [[#undo-tree][=undo-tree=]]
    - [[#wiki-summary][=wiki-summary=]]
  - [[#which-key][=which-key=]]
  - [[#ivy][Ivy]]
  - [[#navigation][Navigation]]
  - [[#parenthesis-rainbow-delimiters][Parenthesis =rainbow-delimiters=]]
  - [[#pdf][PDF]]
  - [[#point-and-region][Point and Region]]
  - [[#recent-files][Recent Files]]
  - [[#whitespaces][Whitespaces]]
    - [[#hungry-delete][=hungry-delete=]]
  - [[#windows][Windows]]
    - [[#windmove][=windmove=]]
    - [[#winner][=winner=]]
  - [[#word-wrap][Word Wrap]]
  - [[#custom-fonction][custom fonction]]
- [[#major-mode][Major mode]]
  - [[#languages][Languages]]
    - [[#emacs-lisp][Emacs Lisp]]
    - [[#markdown][Markdown]]
    - [[#latex][LaTeX]]
    - [[#cobol][Cobol]]
    - [[#coq][COQ]]
    - [[#ocamla][OCamla]]
    - [[#java][Java]]
    - [[#typescript][Typescript]]
    - [[#yaml][Yaml]]
    - [[#config][config]]
  - [[#ledger][Ledger]]
    - [[#ynab][YNAB]]
    - [[#ledger-capture][ledger capture]]
  - [[#org][Org]]
    - [[#table-of-content][Table of Content]]
    - [[#cleaner-indentation][cleaner indentation]]
    - [[#agenda][Agenda]]
    - [[#bullets][Bullets]]
    - [[#capture][Capture]]
    - [[#clock][Clock]]
    - [[#contacts][Contacts]]
    - [[#custormization][Custormization]]
    - [[#journal][Journal]]
    - [[#languages-1][Languages]]
    - [[#other-improvment][Other improvment]]
  - [[#mail-gnus][Mail ==gnus==]]
  - [[#contact-bbdb][Contact ==bbdb==]]
  - [[#git-magit][Git ==magit==]]
  - [[#file-explorer-dired][File Explorer ==dired==]]
  - [[#password-store-pass][password-store ==pass==]]
  - [[#irc-erc][IRC ==erc==]]

* Emacs Initialization
** Packages Sources
   In order to install packages, it is useful to configure the package sources.
#+BEGIN_SRC emacs-lisp :tangle yes
(setq package-archives '(
     ("melpa" . "http://melpa.org/packages/")
     ("gnu" . "http://elpa.gnu.org/packages/")
     ("org" . "http://orgmode.org/elpa/")
     ("marmalade" . "http://marmalade-repo.org/packages/")))
#+END_SRC
** use-package
   To be able to manage its configuration with =use-package= it is necessary to
   first install it, if you don't already.
   *NOTE:* Need to understand if it use also the package manager of emacs
   Also ensure that the package is installed and if not tries to install it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (use-package use-package-ensure-system-package
   :ensure t
   :config
   (setq use-package-always-ensure t)); Avoid the :ensure keyword for each package

  (use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t)
  (setq auto-package-update-hide-results t)
  (auto-package-update-maybe))
#+END_SRC
** delight
   delight is a way of showing wich major/minor is currently open
   It's show which mode on the main bar
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package delight)
#+END_SRC
** Authentification
   In which file the authentification is save
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auth-sources '( "~/.authinfo.gpg" ))
#+END_SRC
** defaults values
For a better user experience of GNU Emacs, here are the default values I use.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package emacs
   :delight
    (auto-fill-function " AF")
    (visual-line-mode)
   :config
    (setq-default
      ad-redefinition-action 'accept                   ; Silence warnings  redefinition
      cursor-in-non-selected-windows t                 ; Hide the cursor in inactive windows
      display-time-default-load-average nil            ; Don't display load average
      fill-column 80                                   ; Set width for automatic line breaks
      help-window-select t                             ; Focus new help windows when opened
      inhibit-startup-screen t                         ; Disable start-up screen
      initial-scratch-message ""                       ; Empty the initial *scratch* buffer
      kill-ring-max 128                                ; Maximum length of kill ring
      load-prefer-newer t                              ; Prefers the newest version of a file
      mark-ring-max 128                                ; Maximum length of mark ring
      scroll-conservatively most-positive-fixnum       ; Always scroll by one line
      select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
      x-select-enable-clipboard t                      ; enable copy pas to classic clipboard
      tab-width 4                                      ; Set width for tabs
      user-full-name "Sylvain Ribstein"                ; Set the full name of the current user
      user-mail-address "sylvain.ribstein@gmail.com"   ; Set the email address of the current user
      vc-follow-symlinks t                             ; Always follow the symlinks
      view-read-only t                                 ; Always open read-only buffers in view-mode
      blink-cursor-mode nil                            ; the cursor wont blink
      indent-tabs-mode nil)                            ; use space instead of tab to indent
      (delete-selection-mode t)                        ; when writing into marked region delete it
      (transient-mark-mode t)                          ; same mark mouse or keyboard
      (cd "~/")                                        ; Move to the user directory
      (column-number-mode 1)                           ; Show the column number
      (display-time-mode 1)                            ; Enable time in the mode-line
      (fset 'yes-or-no-p 'y-or-n-p)                    ; Replace yes/no prompts with y/n
      (global-hl-line-mode)                            ; Hightlight current line
      (set-default-coding-systems 'utf-8)              ; Default to utf-8 encoding
      (show-paren-mode 1)                              ; Show the parenthesis
      (put 'upcase-region 'disabled nil)               ; Allow C-x C-u
      (put 'downcase-region 'disabled nil))             ; Allow C-x C-l
#+END_SRC

** Customization
   To avoid overloading the GNU Emacs custormization =init.el= file made by the
   user with the UI, I add the generated code in a separate file.
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default custom-file (expand-file-name "~/.emacs.d/custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file t))
#+END_SRC

** Turn off menu, toolbar and stuff
   Since I never use the mouse with GNU Emacs, I prefer not to use certain
   graphical elements as seen as the menu bar, toolbar, scrollbar and tooltip
   that I find invasive.
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq menu-bar-mode nil)                              ; Disable the menu bar
  (setq scroll-bar-mode nil)                            ; Disable the scroll bar
  (setq tool-bar-mode nil)                              ; Disable the tool bar
  (setq tooltip-mode nil)                               ; Disable the tooltips
#+END_SRC

* Advanced Configuration
** Auto-Completion =company=

=company= provides auto-completion at point and to Displays a small pop-in
containing the candidates.

#+BEGIN_QUOTE
Company is a text completion framework for Emacs. The name stands for "complete
anything". It uses pluggable back-ends and front-ends to retrieve and display
completion candidates.

[[http://company-mode.github.io/][Dmitry Gutov]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company
    :delight
    :custom
    (company-begin-commands '(self-insert-command))
    (company-idle-delay .1)
    (company-minimum-prefix-length 2)
    (company-show-numbers t)
    (company-tooltip-align-annotations 't)
    (global-company-mode t))
#+END_SRC

# I use =company= with =company-box= that allows a company front-end with icons.

# #+BEGIN_SRC emacs-lisp :tangle yes
#    (use-package company-box
#      :after company
#      :delight
#      :hook (company-mode . company-box-mode))
# #+END_SRC

** Backups
   It is important to have a stable backup environment. Don't hesitate to save a
   lot.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package files
    :ensure nil
    :custom
    (backup-directory-alist `(("." . "~/.emacs.d/backup")))
    (delete-old-versions -1)
    (vc-make-backup-files t)
    (version-control t))
#+END_SRC

** Browser (Firefox)
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq browse-url-browser-function 'browse-url-firefox)
#+END_SRC
*** Online search =engine-mode=
	With it I can start a search from within emacs,I use duckduckgo and bang.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package engine-mode
    :config
    (defengine duckduckgo
      "https://duckduckgo.com/?q=%s"
      :keybinding "d")
    :bind ("C-x /" . engine/search-duckduckgo))
#+END_SRC
