.emacs.d/config.org
** Ivy

I used =helm= before, but I find =ivy= faster and lighter.

#+BEGIN_QUOTE
Ivy is a generic completion mechanism for Emacs. While it operates similarly to
other completion schemes such as icomplete-mode, Ivy aims to be more efficient,
smaller, simpler, and smoother to use yet highly customizable.

[[https://github.com/abo-abo/ivy][Oleh Krehel]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package counsel
    :after ivy
    :delight
    :config (counsel-mode))

  (use-package ivy
    :delight
    :bind (("C-c C-r" . ivy-resume)
           ("C-x B" . ivy-switch-buffer-other-window))
    :custom
      (ivy-count-format "(%d/%d) ")
      (ivy-use-virtual-buffers t)
    :config (ivy-mode))

  (use-package ivy-pass
    :after ivy
    :commands ivy-pass)

  (use-package ivy-rich
    :after ivy
    :init (setq ivy-rich-parse-remote-file-path t)
    :config (ivy-rich-mode 1))

  (use-package swiper
    :after ivy
    :bind (("C-s" . swiper)
           ("C-r" . swiper)))
#+END_SRC

** Navigation

This function is a mix of =C-a= and =M-m=.

From: http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/smarter-move-beginning-of-line (arg)
  "Moves point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

(global-set-key [remap org-beginning-of-line] #'my/smarter-move-beginning-of-line)
(global-set-key [remap move-beginning-of-line] #'my/smarter-move-beginning-of-line)
#+END_SRC

** Parenthesis =rainbow-delimiters=

#+BEGIN_QUOTE
rainbow-delimiters is a "rainbow parentheses"-like mode which highlights
delimiters such as parentheses, brackets or braces according to their
depth. Each successive level is highlighted in a different color. This makes it
easy to spot matching delimiters, orient yourself in the code, and tell which
statements are at a given depth.

[[https://github.com/Fanael/rainbow-delimiters][Fanael Linithien]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

** PDF
#+BEGIN_QUOTE
PDF Tools is, among other things, a replacement of DocView for PDF files. The
key difference is that pages are not pre-rendered by e.g. ghostscript and stored
in the file-system, but rather created on-demand and stored in memory.
[[https://github.com/politza/pdf-tools][Andras Politz]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package pdf-tools
     :magic ("%PDF" . pdf-view-mode)
     :init (pdf-tools-install :no-query))
   (use-package pdf-view
     :ensure nil
     :after pdf-tools
     :bind (:map pdf-view-mode-map
                 ("C-s" . isearch-forward)
                 ("d" . pdf-annot-delete)
                 ("h" . pdf-annot-add-highlight-markup-annotation)
                 ("t" . pdf-annot-add-text-annotation))
     :custom
     (pdf-view-display-size 'fit-page)
     (pdf-view-resize-factor 1.1)
     (pdf-view-use-unicode-ligther nil))
 #+END_SRC

** Point and Region
Increase region by semantic units. It tries to be smart about it and adapt to
the structure of the current major mode.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package expand-region
    :bind (("C-+" . er/contract-region)
           ("C-=" . er/expand-region)))
#+END_SRC

I find useful to delete a line and a region with only =C-w=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defadvice kill-region (before slick-cut activate compile)
    "When called interactively with no active region, kill a single line instead."
    (interactive
     (if mark-active (list (region-beginning) (region-end))
       (list (line-beginning-position)
             (line-beginning-position 2)))))
#+END_SRC

** Recent Files

Provides fast access to the recent files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package recentf
    :defer 2
    :bind ("C-x r" . recentf-open-files)
    :init (recentf-mode)
    :custom
    (recentf-exclude (list "COMMIT_EDITMSG"
                           "~$"
                           "/scp:"
                           "/ssh:"
                           "/sudo:"
                           "/tmp/"
                           "recentf"
                           ".newsrc-dribble"
                           ))
    (recentf-max-menu-items 15)
    (recentf-max-saved-items 200)
    (recentf-save-file "~/.emacs.d/recentf" )
    :config (run-at-time nil (* 5 60) 'recentf-save-list))
#+END_SRC

** Whitespaces

It is often annoying to see unnecessary blank spaces at the end of a line or file.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package whitespace
    :commands delete-trailing-whitespace
    :hook before-save)
#+END_SRC

*** =hungry-delete=

#+BEGIN_QUOTE
Deleting a whitespace character will delete all whitespace until the next
non-whitespace character.

# [[https://github.com/nflath/hungry-delete][Nathaniel Flath]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hungry-delete
    :delight
    :config (global-hungry-delete-mode))
#+END_SRC

** Windows
Don't ask before killing a buffer. I know what I'm doing.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key [remap kill-buffer] #'kill-this-buffer)
#+END_SRC


*** =windmove=

# # Allows you to move from one window to another with something more natural than
# # cycling through =C-x o= (=other-window=).

# # #+BEGIN_SRC emacs-lisp :tangle yes
# #   (use-package windmove
# #     :defer 0.2
# #     :bind (("C-c h" . windmove-left)
# #            ("C-c j" . windmove-down)
# #            ("C-c k" . windmove-up)
# #            ("C-c l" . windmove-right)))
# # #+END_SRC

*** =winner=

I often undo's and redo's with window configurations.

#+BEGIN_QUOTE
Winner mode is a global minor mode that records the changes in the window
configuration (i.e. how the frames are partitioned into windows) so that the
changes can be "undone" using the command =winner-undo=. By default this one is
bound to the key sequence ctrl-c left. If you change your mind (while undoing),
you can press ctrl-c right (calling =winner-redo=).

[[https://github.com/emacs-mirror/emacs/blob/master/lisp/winner.el][Ivar Rummelhoff]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package winner
    :defer 2
    :config (winner-mode 1))
#+END_SRC

** Word Wrap

I like to have lines of the same length.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package simple
    :ensure nil
    :delight (auto-fill-function)
    :bind ("C-x p" . pop-to-mark-command)
    :hook ((prog-mode . turn-on-auto-fill)
           (text-mode . turn-on-auto-fill))
    :custom (set-mark-command-repeat-pop t))
#+END_SRC


** custom fonction
#+BEGIN_SRC emacs-lisp :tangle yes
;; revert all open file buffer
(defun revert-all-buffers ()
  "Refreshes all open buffers from their respective files."
  (interactive)
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (when (and (buffer-file-name) (file-exists-p (buffer-file-name)) (not (buffer-modified-p)))
        (revert-buffer t t t) )))
  (message "Refreshed open files.") )

;; reload emacs config
(defun reload-dotemacs-file ()
  "reload your .emacs file without restarting Emacs"
  (interactive)
  (load-file "~/.emacs.d/init.el"))

#+END_SRC

* Major mode
** Languages
   test test
*** Emacs Lisp
 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package elisp-mode :ensure nil :delight "ξ ")
 #+END_SRC
**** Eldoc

 Provides minibuffer hints when working with Emacs Lisp.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package eldoc
     :delight
     :hook (emacs-lisp-mode . eldoc-mode))
 #+END_SRC

*** Markdown
 Before you can use this package, make sure you install =markdown= on your
 operating system.
 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package markdown-mode
     :delight "μ "
     :mode ("INSTALL\\'"
            "CONTRIBUTORS\\'"
            "LICENSE\\'"
            "README\\'"
            "\\.markdown\\'"
            "\\.md\\'"))
 #+END_SRC

*** LaTeX
 I use LaTeX for my reports, CVs, summaries, etc.

 #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package tex
        :ensure auctex
        :hook (LaTeX-mode . reftex-mode)
        :custom
        (TeX-PDF-mode t)
        (TeX-auto-save t)
        (TeX-byte-compile t)
        (TeX-clean-confirm nil)
        (TeX-master 'dwim)
        (TeX-parse-self t)
        (TeX-source-correlate-mode t)
        (TeX-view-program-selection '((output-pdf "Evince")
                                      (output-html "xdg-open"))))

      (use-package bibtex
        :after auctex
        :hook (bibtex-mode . my/bibtex-fill-column))

      ;; (use-package company-auctex
      ;;   :after (auctex company)
      ;;   :config (company-auctex-init))

      ;; (use-package company-math
      ;;     :after (auctex company))
 #+END_SRC

 #+RESULTS:

 I want a TeX engine that can deal with Unicode and use any font I like.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (setq-default TeX-engine 'xetex)
 #+END_SRC

**** =reftex=

 Minor mode with distinct support for \label, \ref and \cite in LaTeX.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package reftex :after auctex)
 #+END_SRC
*** Cobol
 #+BEGIN_SRC emacs-lisp :tangle yes
 (use-package cobol-mode
  :mode ("\\.cbl\\'" "\\.cpy\\'" "\\.pco\\'"))
 #+END_SRC
