.emacs.d/config.org
*** COQ
 #+BEGIN_SRC emacs-lisp :tangle yes
;; (eval-after-load 'proof-script
;;   '(progn
;;      ;; (define-key proof-mode-map "\M-e" 'move-end-of-line)
;;      ;; (define-key proof-mode-map "\M-a" 'move-beginning-of-line)
;;      ;; (define-key proof-mode-map "\M-n"
;;      ;;   'proof-assert-next-command-interactive)
;;      ;; (define-key proof-mode-map "\M-p"
;;      ;;   'proof-undo-last-successful-command)
;;      (define-key proof-mode-map (kbd "\C-p") 'coq-About)
;;      (define-key proof-mode-map (kbd "\C-c\C-k")
;;        'proof-goto-point)
;;      ))
;; ;; Better indent for ssreflect
;; (setq coq-one-command-per-line nil)
;; (setq coq-indent-proofstart 0)
;; (setq coq-indent-modulestart 0)
;; ;; ;; input math symbol
;; (add-hook 'proof-mode-hook (lambda () (set-input-method "TeX") ))
;; ;; Open .v files with Proof General's Coq mode
;; (require 'proof-site "~/.emacs.d/lisp/PG/generic/proof-site")
 #+END_SRC

*** OCamla
 #+BEGIN_SRC emacs-lisp :tangle yes
   ;; (setq utop-command "opam config exec -- utop -emacs")
   ;; (add-to-list 'load-path
   ;;              "/home/baroud/.opam/4.07.1+flambda/share/emacs/site-lisp")
   ;; (require 'ocp-indent)
      (setq utop-command "opam config exec -- utop -emacs")
      (add-to-list 'load-path
                   "/home/baroud/.opam/4.07.1+flambda/share/emacs/site-lisp")
       ;; (use-package ocp-indent
      ;; after:)
#+END_SRC
*** Java
**** Antlr
     lexer/parser generator LL(*) for java langage
  #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package antlr-mode
      :mode ("\\.g4\\'"))
  #+END_SRC

**** Groovy
     Script version of java
     run on jvm
  #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package groovy-mode
      :mode ("\\.groovy\\'" "\\.gvy\\'" "\\.gy\\'""\\.gsh\\'" )
      :hook gradle-mode)
  #+END_SRC
**** Gradle
     Gradle is a dependency manager
  #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package gradle-mode
      :mode ("\\.gradle\\'")
      )

  #+END_SRC

*** Typescript
 #+BEGIN_SRC emacs-lisp :tangle yes
 (use-package typescript-mode
    :mode ("\\.ts\\'"))
 #+END_SRC

*** Yaml
    Yet another marked langage
 #+BEGIN_SRC emacs-lisp :tangle yes
 (use-package yaml-mode
     :mode ("\\.yml\\'"))
 #+END_SRC
*** config
**** Git config file
 #+BEGIN_SRC emacs-lisp :tangle yes
 (use-package gitignore-mode)
 #+END_SRC

** Ledger
*** [[https://www.youneedabudget.com/the-four-rules/][YNAB]]
    You need a budged : four simple rule to control you budged
**** Give Every Dollar a Job
     As soon as you get money, you’ll decide what it needs to do—whatever is most
     important to you. Then, instead of deciding to buy something based on your
    mood, or the big (or small?) pile of money in your checking account, you’ll
    decide based on a rock-solid plan.

     1. Get some dollars.
     2. Prioritize those dollars (give ‘em jobs!).
     3. Follow your plan.
****  Embrace Your True Expenses
     Take those large, less-frequent expenses (that usually send you into a financial
     tailspin) and break them into manageable, monthly “bills.” Good-bye, Financial
     Crisis Roller Coaster! You just won a free ticket on the Financial Peace
     Express!

     1. Find a big, infrequent expense.
     2. Create a goal to fund it monthly.
     3. When that expense arrives, just pay it!
**** Roll With The Punches
     When you overspend in a budget category, just adjust. No guilt necessary. If you
     plan to take the kids to the beach but it’s pouring down rain, do you still go?
     Of course not! Circumstances change and plans change with them. Your budget is
     no different. If you overspend in one category, free up money from another
     category and move along. Remember, you’re the boss!

     1. Choose a category with overspending.
     2. Move funds from another category to cover it.
     3. Move on with your life—no guilt!
**** Age Your Money
     With the help of the other three rules, you’ll be more purposeful about your
     spending, consistently spend less than you earn, and be more than prepared for
     the future. Eventually, you’ll be able to cover May’s rent with dollars from
     April. Your money will be at least 30 days old and you’ll wonder how you ever
     lived without the Four Rules.

     1. Be purposeful in your spending.
     2. Consistently spend less than you earn.
     3. Watch that Age of Money grow!


 #+BEGIN_QUOTE
 Ledger is a powerful, double-entry accounting system that is accessed from the
 UNIX command-line.
*** ledger capture
 [[https://github.com/ledger/ledger][John Wiegley]]
 #+END_QUOTE

 Before you can use this configuration, make sure you install =ledger= on your
 operating system.

 Now all we have to do is configure =ledger-mode=:

 #+begin_SRC emacs-lisp :tangle yes
   (use-package ledger-mode
     :mode ("\\.dat\\'" "\\.ledger\\'")
     :bind (:map ledger-mode-map ("c-x c-s" . my/ledger-save))
     :hook (ledger-mode . ledger-flymake-enable)
     :preface
     (defun my/ledger-save ()
       "automatically clean the ledger buffer at each save."
       (interactive)
       (ledger-mode-clean-buffer)
       (save-buffer))
     :custom
     (ledger-clear-whole-transactions t)
     (ledger-reconcile-default-commodity "eur")
     (ledger-reports
      '(("account statement" "%(binary) reg --real [[ledger-mode-flags]] -f %(ledger-file) ^%(account)")
        ("balance sheet" "%(binary) --real [[ledger-mode-flags]] -f %(ledger-file) bal ^assets ^liabilities ^equity")
        ("budget" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:budget")
        ("budget goals" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget goals'")
        ("budget obligations" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget obligations'")
        ("budget debts" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget debts'")
        ("cleared" "%(binary) cleared [[ledger-mode-flags]] -f %(ledger-file)")
        ("equity" "%(binary) --real [[ledger-mode-flags]] -f %(ledger-file) equity")
        ("income statement" "%(binary) --invert --real -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^income ^expenses -p \"this month\""))
      (ledger-report-use-header-line nil)))

      (use-package flycheck-ledger :after ledger-mode)
 #+end_src
 *note:* by default, =ledger= uses the [[ https://xkcd.com/1179/][iso 8601]] format to write dates, which is the recommended
 format.

** Org

 One of my favorite modes in GNU Emacs. I mainly use it to organize my life,
 take notes and make my presentations, but you can do lots of things with
 it. =org-mode= it's like the sky, without limits.

 #+BEGIN_QUOTE
 Org mode is for keeping notes, maintaining TODO lists, planning projects, and
 authoring documents with a fast and effective plain-text system.

 [[http://orgmode.org/][Carsten Dominik]]
 #+END_QUOTE

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org
     :ensure org-plus-contrib
     :delight "Θ "
     :bind
      ("C-c l" . org-store-link)
      ("C-c a" . org-agenda)
      ("C-c c" . org-capture)
     :custom
        (org-use-extra-keys t)
        (org-catch-invisible-edits 'show-and-error)
        (org-cycle-separator-lines 0))
 #+END_SRC
*** Table of Content
    If like me, you're tired of manually updating your tables of contents, =toc-org=
    will maintain a table of contents at the first heading that has a =:TOC:= tag.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package toc-org
     :after org
     :hook (org-mode . toc-org-enable))
 #+END_SRC
*** cleaner indentation

 For a cleaner online mode.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-indent :after org :ensure nil :delight)
 #+END_SRC

*** Agenda

 Nowadays, it is crucial to be organized. Even more than before. That is why it
 is important to take the time to make a configuration that is simple to use and
 that makes your life easier with an irreproachable organization.

 =org-agenda= allows me to be organized with daily tasks. As a result, I can use
 my time to the fullest.

 #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package org-agenda
        :ensure nil
        :after org
        :custom
        (org-directory "~/org")
        (org-agenda-files '("~/org/")
        (org-agenda-dim-blocked-tasks t)
        (org-agenda-inhibit-startup t)
        (org-agenda-show-log t)
        (org-agenda-skip-deadline-if-done t)
        (org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
        (org-agenda-skip-scheduled-if-done t)
        (org-agenda-span 2)
        (org-agenda-sticky nil)
        (org-agenda-tags-column -100)
        (org-agenda-time-grid '((daily today require-timed)))
        (org-agenda-use-tag-inheritance t)
        (org-enforce-todo-dependencies t)
        (org-habit-graph-column 80)
        (org-habit-show-habits-only-for-today nil)
        (org-track-ordered-property-with-tag t))
        (org-agenda-custom-commands
          (quote
          (("z" "Clean agenda" agenda ""
          ((org-agenda-tag-filter-preset
            (quote  ("-volim" "-hidden")))))))))


     (use-package calfw :after org-agenda)

     (use-package calfw-org
        :after calfw
        :bind ("C-c z" . cfw:open-org-calendar)
        :custom
        cfw:org-overwrite-default-keybinding t)

 #+END_SRC

*** Bullets

 Prettier [[https://github.com/sabof/org-bullets][bullets]] in org-mode.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-bullets
     :hook (org-mode . org-bullets-mode)
     :custom (org-bullets-bullet-list '("●" "▲" "■" "✶" "◉" "○" "○")))
 #+END_SRC

