.emacs.d/config.el

;; (eval-after-load 'proof-script
;;   '(progn
;;      ;; (define-key proof-mode-map "\M-e" 'move-end-of-line)
;;      ;; (define-key proof-mode-map "\M-a" 'move-beginning-of-line)
;;      ;; (define-key proof-mode-map "\M-n"
;;      ;;   'proof-assert-next-command-interactive)
;;      ;; (define-key proof-mode-map "\M-p"
;;      ;;   'proof-undo-last-successful-command)
;;      (define-key proof-mode-map (kbd "\C-p") 'coq-About)
;;      (define-key proof-mode-map (kbd "\C-c\C-k")
;;        'proof-goto-point)
;;      ))
;; ;; Better indent for ssreflect
;; (setq coq-one-command-per-line nil)
;; (setq coq-indent-proofstart 0)
;; (setq coq-indent-modulestart 0)
;; ;; ;; input math symbol
;; (add-hook 'proof-mode-hook (lambda () (set-input-method "TeX") ))
;; ;; Open .v files with Proof General's Coq mode
;; (require 'proof-site "~/.emacs.d/lisp/PG/generic/proof-site")

;; (setq utop-command "opam config exec -- utop -emacs")
;; (add-to-list 'load-path
;;              "/home/baroud/.opam/4.07.1+flambda/share/emacs/site-lisp")
;; (require 'ocp-indent)
   (setq utop-command "opam config exec -- utop -emacs")
   (add-to-list 'load-path
                "/home/baroud/.opam/4.07.1+flambda/share/emacs/site-lisp")
    ;; (use-package ocp-indent
   ;; after:)

(use-package antlr-mode
  :mode ("\\.g4\\'"))

(use-package groovy-mode
    :mode ("\\.groovy\\'" "\\.gvy\\'" "\\.gy\\'""\\.gsh\\'" )
    :hook gradle-mode)

(use-package gradle-mode
    :mode ("\\.gradle\\'")
    )

(use-package typescript-mode
   :mode ("\\.ts\\'"))

(use-package yaml-mode
    :mode ("\\.yml\\'"))

(use-package gitignore-mode)

(use-package ledger-mode
  :mode ("\\.dat\\'" "\\.ledger\\'")
  :bind (:map ledger-mode-map ("c-x c-s" . my/ledger-save))
  :hook (ledger-mode . ledger-flymake-enable)
  :preface
  (defun my/ledger-save ()
    "automatically clean the ledger buffer at each save."
    (interactive)
    (ledger-mode-clean-buffer)
    (save-buffer))
  :custom
  (ledger-clear-whole-transactions t)
  (ledger-reconcile-default-commodity "eur")
  (ledger-reports
   '(("account statement" "%(binary) reg --real [[ledger-mode-flags]] -f %(ledger-file) ^%(account)")
     ("balance sheet" "%(binary) --real [[ledger-mode-flags]] -f %(ledger-file) bal ^assets ^liabilities ^equity")
     ("budget" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:budget")
     ("budget goals" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget goals'")
     ("budget obligations" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget obligations'")
     ("budget debts" "%(binary) --empty -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^assets:bank ^assets:receivables ^assets:cash ^assets:'budget debts'")
     ("cleared" "%(binary) cleared [[ledger-mode-flags]] -f %(ledger-file)")
     ("equity" "%(binary) --real [[ledger-mode-flags]] -f %(ledger-file) equity")
     ("income statement" "%(binary) --invert --real -s -t [[ledger-mode-flags]] -f %(ledger-file) bal ^income ^expenses -p \"this month\""))
   (ledger-report-use-header-line nil)))

   (use-package flycheck-ledger :after ledger-mode)

(use-package org
  :ensure org-plus-contrib
  :delight "Θ "
  :bind
   ("C-c l" . org-store-link)
   ("C-c a" . org-agenda)
   ("C-c c" . org-capture)
  :custom
     (org-use-extra-keys t)
     (org-catch-invisible-edits 'show-and-error)
     (org-cycle-separator-lines 0))

(use-package toc-org
  :after org
  :hook (org-mode . toc-org-enable))

(use-package org-indent :after org :ensure nil :delight)

(use-package org-agenda
   :ensure nil
   :after org
   :custom
   (org-directory "~/org")
   (org-agenda-files '("~/org/")
   (org-agenda-dim-blocked-tasks t)
   (org-agenda-inhibit-startup t)
   (org-agenda-show-log t)
   (org-agenda-skip-deadline-if-done t)
   (org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
   (org-agenda-skip-scheduled-if-done t)
   (org-agenda-span 2)
   (org-agenda-sticky nil)
   (org-agenda-tags-column -100)
   (org-agenda-time-grid '((daily today require-timed)))
   (org-agenda-use-tag-inheritance t)
   (org-enforce-todo-dependencies t)
   (org-habit-graph-column 80)
   (org-habit-show-habits-only-for-today nil)
   (org-track-ordered-property-with-tag t))
   (org-agenda-custom-commands
     (quote
     (("z" "Clean agenda" agenda ""
     ((org-agenda-tag-filter-preset
       (quote  ("-volim" "-hidden")))))))))


(use-package calfw :after org-agenda)

(use-package calfw-org
   :after calfw
   :bind ("C-c z" . cfw:open-org-calendar)
   :custom
   cfw:org-overwrite-default-keybinding t)

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom (org-bullets-bullet-list '("●" "▲" "■" "✶" "◉" "○" "○")))
