.emacs.d/config.org
*** Capture
 =org-capture= templates saves you a lot of time when adding new entries. I use
 it to quickly record tasks, ledger entries, notes and other semi-structured
 information.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-capture
     :ensure nil
     :after org
     :preface
     (defun org-capture-template-goto-link ()
          "Set point for capturing at what capture target file+headline with headline set to %l would do."
          (org-capture-put :target (list 'file+headline (nth 1 (org-capture-get :target))
                                                               (org-capture-get :annotation)))
          (org-capture-put-target-region-and-position)
          (widen)
          (let ((hd (nth 2 (org-capture-get :target))))
               (goto-char (point-min))
               (if (re-search-forward
                   (format org-complex-heading-regexp-format (regexp-quote hd)) nil t)
               (goto-char (point-at-bol))
               (goto-char (point-max))
               (or (bolp) (insert "\n"))
               (insert "* " hd "\n")
               (beginning-of-line 0))))

     (defvar my/org-people-template "** %\\1 %\\2
   :PROPERTIES:
   :Nombre:        %^{Nombre}
   :Apellido:      %^{Apellido}%?
   :Compleanos:    %^{Fecha de nacimiento}u
   :Telefono:      %^{Telefono}
   :Correo:        %^{Correo}
   :Direccion:     %^{Direccion}
   :Ciudad:        %^{Ciudad}
   :Pais:          %^{Pais}
   :Codigo postal: %^{Codigo postal}
   :Map:      [[google-maps:%\\5+%\\6+%\\7+%\\8][Google Maps]]
   :Nota:
   :END:"
   )

   (defvar my/org-adress-template "** %\\1
   :PROPERTIES:
   :Nombre:        %^{Nombre}
   :Telefono:      %^{Telefono}
   :Correo:        %^{Correo}
   :Direccion:     %^{Direccion}
   :Ciudad:        %^{Ciudad}
   :Pais:          %^{Pais}
   :Codigo postal: %^{Codigo postal}
   :Map:      [[google-maps:%\\5+%\\6+%\\7+%\\8][Google Maps]]
   :END: "
   )

   (defvar my/org-espectaculo-template "*** %\\1
   :PROPERTIES:
   :nombre:   %^{Nombre}
   :tipo:     %^{tipo}p
   :lugar:    %^{Lugar}
   :con:      %^{Con}
   :cuando:   %^{Cuando}t
   :END: "
   )

   (defvar my/org-personal-template "*** %\\1
   :PROPERTIES:
   :nombre:   %^{Nombre}
   :lugar:    %^{Lugar}
   :con:      %^{Con}
   :cuando:   %^{Cuando}t
   :END: "
   )

   (defvar my/org-transporte-template "** %\\1 -> %\\2
   :PROPERTIES:
   :de:       %^{de}
   :a:        %^{a}
   :tipo:     %^{tipo}p
   :con:      %^{Con}
   :cuando:   %^{Cuando}t
   :END: "
   )

   (defvar my/org-ida-vuelta-template "** %\\1 -> %\\2
   :PROPERTIES:
   :de:       %^{de}
   :a:        %^{a}
   :tipo:     %^{tipo}p
   :con:      %^{Con}
   :cuando:   %^{Cuando}t
   :END:
   ,** %\\2 -> %\\1
   :PROPERTIES:
   :de:       %\\2
   :a:        %\\1
   :tipo:     %^{tipo}p
   :con:      %^{Con}
   :cuando:   %^{Cuando}t
   :END: "
   )

   (defvar my/org-administrativod-template "** TODO %^{Que}
   DEADLINE:   %^{Fecha tope}t
   ")

   (defvar my/org-administrativos-template "** TODO %^{Que}
   SCHEDULED:   %^{Programado}t
   ")

   (defvar my/org-administrativo-template  "** TODO %^{Que}
   :PROPERTIES:
   :cuando:   %^{Cuando}t
   :END:")

   :custom
   (org-capture-templates `(
   ("c" "Contact")
      ("cg" "Gente" entry (file+headline "~/org/contacts.org" "People"),
           my/org-people-template :empty-lines 1)
      ("ca" "Lugar" entry (file+headline "~/org/contacts.org" "Adress"),
           my/org-people-template :empty-lines 1)
   ("e" "Evento")
      ("es" "Espectaculo" entry (file+headline "~/org/diario.org" "Espectaculo"),
           my/org-espectaculo-template :empty-lines 1)
      ("ep" "Personal" entry (file+headline "~/org/diario.org" "Personal"),
           my/org-personal-template :empty-lines 1)
   ("v" "Viaje")
      ("vi" "Viaje individual" entry (file+headline "~/org/diario.org" "Transporte"),
           my/org-transporte-template :empty-lines 1)
      ("vv" "Viaje ida y vulta" entry (file+headline "~/org/diario.org" "Transporte"),
           my/org-ida-vuelta-template :empty-lines 1)
   ("a" "Administrativo")
      ("am" "meeting" entry (file+headline "~/org/diario.org" "Administrativo"),
           my/org-administrativo-template :empty-lines 1)
      ("as" "scheduled" entry (file+headline "~/org/diario.org" "Administrativo"),
           my/org-administrativos-template :empty-lines 1)
      ("ad" "deadline" entry (file+headline "~/org/diario.org" "Administrativo"),
           my/org-administrativod-template :empty-lines 1))))

 #+END_SRC

*** Clock

 # # Being organized is one thing, but being optimal is another. =org-clock= allows
 # # you to estimate your tasks and time them. This is useful, since with experience,
 # # you can have a better estimate of the time that needs to be given to each task.

 # # #+BEGIN_SRC emacs-lisp :tangle yes
 # #   (use-package org-clock
 # #     :ensure nil
 # #     :after org
 # #     :preface
 # #     (defun my/org-mode-ask-effort ()
 # #       "Ask for an effort estimate when clocking in."
 # #       (unless (org-entry-get (point) "Effort")
 # #         (let ((effort
 # #                (completing-read
 # #                 "Effort: "
 # #                 (org-entry-get-multivalued-property (point) "Effort"))))
 # #           (unless (equal effort "")
 # #             (org-set-property "Effort" effort)))))
 # #     :hook (org-clock-in-prepare-hook . my/org-mode-ask-effort)
 # #     :custom
 # #     (org-clock-clocktable-default-properties
 # #      '(:block day :maxlevel 2 :scope agenda :link t :compact t :formula %
 # #               :step day :fileskip0 t :stepskip0 t :narrow 80
 # #               :properties ("Effort" "CLOCKSUM" "CLOCKSUM_T" "TODO")))
 # #     (org-clock-continuously nil)
 # #     (org-clock-in-switch-to-state "STARTED")
 # #     (org-clock-out-remove-zero-time-clocks t)
 # #     (org-clock-persist t)
 # #     (org-clock-persist-file (expand-file-name (format "%s/emacs/org-clock-save.el" xdg-cache)))
 # #     (org-clock-persist-query-resume nil)
 # #     (org-clock-report-include-clocking-task t)
 # #     (org-show-notification-handler (lambda (msg) (alert msg))))
 # # #+END_SRC

*** Contacts
    The best solution to maintain your contacts. I tend to use =org-contacts= to
    remember their birthdays so I can be the first to wish them that. Be careful
    that to install it, this one is available with =org-plus-contrib=.
 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-contacts
     :ensure nil
     :after org
     :custom (org-contacts-files '("~/org/contacts.org")))
 #+END_SRC

*** Custormization

 Let's change the foreground and the weight of each keywords.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-faces
     :ensure nil
     :after org
     :custom
     (org-todo-keyword-faces
      '(("DONE" . (:foreground "cyan" :weight bold))
        ("SOMEDAY" . (:foreground "gray" :weight bold))
        ("TODO" . (:foreground "green" :weight bold))
        ("WAITING" . (:foreground "red" :weight bold)))))
 #+END_SRC

*** COMMENT Encryption / Decryption

 To be able to enable encryption and decryption of =.gpg= files with =org-mode=,
 we will need to install =gnupg2=.

 Once this is done, we simply configure =org-crypt= to accept our public key
 identifier to allow asymmetric encryption.

 *NOTE:* you need to modify the =org-crypt-key= variable to replace my key
 identifier, by yours (or =nil= to allow symmetric encryption).

 # #+BEGIN_SRC emacs-lisp :tangle yes
 #   (use-package org-crypt
 #     :ensure nil
 # 	:after org
 #     :init (org-crypt-use-before-save-magic)
 #     :custom (org-crypt-key "E9AADC36E94A672D1A07D49B208FCDBB98190562"))
 # #+END_SRC

*** Journal

 # # Recently, I started writing a journal about my daily life as I read that
 # # journals improve mental claritym, help solve problems, improve overall focus,
 # # insight and understanding, track the overall development and facilitate personal
 # # growth.

 # # #+BEGIN_SRC emacs-lisp :tangle yes
 # #   (use-package org-journal
 # #     :after org
 # #     :bind (("C-c t" . org-journal-new-entry)
 # #            ("C-c Y" . journal-file-yesterday))
 # #     :preface
 # #     (defun get-journal-file-yesterday ()
 # #       "Gets filename for yesterday's journal entry."
 # #       (let* ((yesterday (time-subtract (current-time) (days-to-time 1)))
 # #              (daily-name (format-time-string "%Y%m%d" yesterday)))
 # #         (expand-file-name (concat org-journal-dir daily-name))))

 # #     (defun journal-file-yesterday ()
 # #       "Creates and load a file based on yesterday's date."
 # #       (interactive)
 # #       (find-file (get-journal-file-yesterday)))
 # #     :custom
 # #     (org-journal-date-format "%e %b %Y (%A)")
 # #     (org-journal-dir "~/.personal/journal/2018/")
 # #     (org-journal-enable-encryption t)
 # #     (org-journal-file-format "%Y%m%d")
 # #     (org-journal-time-format ""))
 # # #+END_SRC

*** Languages

 With that, I can compile many languages with =org-mode=.

 #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package ob-C :ensure nil :after org)
   ;; (use-package ob-css :ensure nil :after org)
   ;; (use-package ob-ditaa :ensure nil :after org)
   ;; (use-package ob-dot :ensure nil :after org)
   (use-package ob-emacs-lisp :ensure nil :after org)
   ;; (use-package ob-gnuplot :ensure nil :after org)
   (use-package ob-java :ensure nil :after org)
   (use-package ob-js :ensure nil :after org)
   (use-package ob-latex :ensure nil :after org)
   (use-package ob-ledger :ensure nil :after org)
   (use-package ob-makefile :ensure nil :after org)
   (use-package ob-org :ensure nil :after org)

   ;; (use-package ob-plantuml
   ;;   :ensure nil
   ;;   :after org
   ;;   :custom (org-plantuml-jar-path (expand-file-name (format "%s/plantuml.jar" xdg-lib))))

   ;; (use-package ob-python :ensure nil :after org)
   ;; (use-package ob-ruby :ensure nil :after org)
   (use-package ob-shell :ensure nil :after org)
   (use-package ob-sql :ensure nil :after org)
 #+END_SRC

*** Other improvment
 #+BEGIN_SRC emacs-lisp :tangle yes
 (defun org-convert-csv-table (beg end)
 (interactive (list (mark) (point)))
 (org-table-convert-region beg end ";")
  )

 #+END_SRC

