.emacs.d/config.el

(use-package org-capture
  :ensure nil
  :after org
  :preface
  (defun org-capture-template-goto-link ()
       "Set point for capturing at what capture target file+headline with headline set to %l would do."
       (org-capture-put :target (list 'file+headline (nth 1 (org-capture-get :target))
                                                            (org-capture-get :annotation)))
       (org-capture-put-target-region-and-position)
       (widen)
       (let ((hd (nth 2 (org-capture-get :target))))
            (goto-char (point-min))
            (if (re-search-forward
                (format org-complex-heading-regexp-format (regexp-quote hd)) nil t)
            (goto-char (point-at-bol))
            (goto-char (point-max))
            (or (bolp) (insert "\n"))
            (insert "* " hd "\n")
            (beginning-of-line 0))))

  (defvar my/org-people-template "** %\\1 %\\2
:PROPERTIES:
:Nombre:        %^{Nombre}
:Apellido:      %^{Apellido}%?
:Compleanos:    %^{Fecha de nacimiento}u
:Telefono:      %^{Telefono}
:Correo:        %^{Correo}
:Direccion:     %^{Direccion}
:Ciudad:        %^{Ciudad}
:Pais:          %^{Pais}
:Codigo postal: %^{Codigo postal}
:Map:      [[google-maps:%\\5+%\\6+%\\7+%\\8][Google Maps]]
:Nota:
:END:"
)

(defvar my/org-adress-template "** %\\1
:PROPERTIES:
:Nombre:        %^{Nombre}
:Telefono:      %^{Telefono}
:Correo:        %^{Correo}
:Direccion:     %^{Direccion}
:Ciudad:        %^{Ciudad}
:Pais:          %^{Pais}
:Codigo postal: %^{Codigo postal}
:Map:      [[google-maps:%\\5+%\\6+%\\7+%\\8][Google Maps]]
:END: "
)

(defvar my/org-espectaculo-template "*** %\\1
:PROPERTIES:
:nombre:   %^{Nombre}
:tipo:     %^{tipo}p
:lugar:    %^{Lugar}
:con:      %^{Con}
:cuando:   %^{Cuando}t
:END: "
)

(defvar my/org-personal-template "*** %\\1
:PROPERTIES:
:nombre:   %^{Nombre}
:lugar:    %^{Lugar}
:con:      %^{Con}
:cuando:   %^{Cuando}t
:END: "
)

(defvar my/org-transporte-template "** %\\1 -> %\\2
:PROPERTIES:
:de:       %^{de}
:a:        %^{a}
:tipo:     %^{tipo}p
:con:      %^{Con}
:cuando:   %^{Cuando}t
:END: "
)

(defvar my/org-ida-vuelta-template "** %\\1 -> %\\2
:PROPERTIES:
:de:       %^{de}
:a:        %^{a}
:tipo:     %^{tipo}p
:con:      %^{Con}
:cuando:   %^{Cuando}t
:END:
** %\\2 -> %\\1
:PROPERTIES:
:de:       %\\2
:a:        %\\1
:tipo:     %^{tipo}p
:con:      %^{Con}
:cuando:   %^{Cuando}t
:END: "
)

(defvar my/org-administrativod-template "** TODO %^{Que}
DEADLINE:   %^{Fecha tope}t
")

(defvar my/org-administrativos-template "** TODO %^{Que}
SCHEDULED:   %^{Programado}t
")

(defvar my/org-administrativo-template  "** TODO %^{Que}
:PROPERTIES:
:cuando:   %^{Cuando}t
:END:")

:custom
(org-capture-templates `(
("c" "Contact")
   ("cg" "Gente" entry (file+headline "~/org/contacts.org" "People"),
        my/org-people-template :empty-lines 1)
   ("ca" "Lugar" entry (file+headline "~/org/contacts.org" "Adress"),
        my/org-people-template :empty-lines 1)
("e" "Evento")
   ("es" "Espectaculo" entry (file+headline "~/org/diario.org" "Espectaculo"),
        my/org-espectaculo-template :empty-lines 1)
   ("ep" "Personal" entry (file+headline "~/org/diario.org" "Personal"),
        my/org-personal-template :empty-lines 1)
("v" "Viaje")
   ("vi" "Viaje individual" entry (file+headline "~/org/diario.org" "Transporte"),
        my/org-transporte-template :empty-lines 1)
   ("vv" "Viaje ida y vulta" entry (file+headline "~/org/diario.org" "Transporte"),
        my/org-ida-vuelta-template :empty-lines 1)
("a" "Administrativo")
   ("am" "meeting" entry (file+headline "~/org/diario.org" "Administrativo"),
        my/org-administrativo-template :empty-lines 1)
   ("as" "scheduled" entry (file+headline "~/org/diario.org" "Administrativo"),
        my/org-administrativos-template :empty-lines 1)
   ("ad" "deadline" entry (file+headline "~/org/diario.org" "Administrativo"),
        my/org-administrativod-template :empty-lines 1))))

(use-package org-contacts
  :ensure nil
  :after org
  :custom (org-contacts-files '("~/org/contacts.org")))

(use-package org-faces
  :ensure nil
  :after org
  :custom
  (org-todo-keyword-faces
   '(("DONE" . (:foreground "cyan" :weight bold))
     ("SOMEDAY" . (:foreground "gray" :weight bold))
     ("TODO" . (:foreground "green" :weight bold))
     ("WAITING" . (:foreground "red" :weight bold)))))

(use-package ob-C :ensure nil :after org)
;; (use-package ob-css :ensure nil :after org)
;; (use-package ob-ditaa :ensure nil :after org)
;; (use-package ob-dot :ensure nil :after org)
(use-package ob-emacs-lisp :ensure nil :after org)
;; (use-package ob-gnuplot :ensure nil :after org)
(use-package ob-java :ensure nil :after org)
(use-package ob-js :ensure nil :after org)
(use-package ob-latex :ensure nil :after org)
(use-package ob-ledger :ensure nil :after org)
(use-package ob-makefile :ensure nil :after org)
(use-package ob-org :ensure nil :after org)

;; (use-package ob-plantuml
;;   :ensure nil
;;   :after org
;;   :custom (org-plantuml-jar-path (expand-file-name (format "%s/plantuml.jar" xdg-lib))))

;; (use-package ob-python :ensure nil :after org)
;; (use-package ob-ruby :ensure nil :after org)
(use-package ob-shell :ensure nil :after org)
(use-package ob-sql :ensure nil :after org)

(defun org-convert-csv-table (beg end)
(interactive (list (mark) (point)))
(org-table-convert-region beg end ";")
 )
