.emacs.d/config.org
** Mail ==gnus==
#+BEGIN_SRC emacs-lisp :tangle yes
    (use-package gnus
      :bind (("C-x e" . gnus)
            :map gnus-group-mode-map
            ("C-c C-f" . gnus-summary-mail-forward))
      :custom
      (gnus-fetch-old-headers t))
    (use-package w3m
      :after gnus)
#+END_SRC

** Contact ==bbdb==

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package bbdb
    :after gnus)
  (use-package bbdb-vcard
    :after bbdb)
  ;; (use-package vdirel
  ;;   :custom
  ;;   (vdirel-repository ~/Contacts))
#+END_SRC

** Git ==magit==

It is quite common to work on Git repositories, so it is important to have a
configuration that we like.

#+BEGIN_QUOTE
[[https://github.com/magit/magit][Magit]] is an interface to the version control system Git, implemented as an Emacs
package. Magit aspires to be a complete Git porcelain. While we cannot (yet)
claim that Magit wraps and improves upon each and every Git command, it is
complete enough to allow even experienced Git users to perform almost all of
their daily version control tasks directly from within Emacs. While many fine
Git clients exist, only Magit and Git itself deserve to be called porcelains.

[[https://github.com/tarsius][Jonas Bernoulli]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package magit
     ;; :defer 0.3
     :bind ("C-x g" . magit-status)
  )
  (use-package git-commit
    :after magit
    :hook (git-commit-mode . my/git-commit-auto-fill-everywhere)
    :custom (git-commit-summary-max-length 50)
    :preface
    (defun my/git-commit-auto-fill-everywhere ()
      "Ensures that the commit body does not exceed 72 characters."
      (setq fill-column 72)
      (setq-local comment-auto-fill-only-comments nil)))
#+END_SRC

In addition to that, I like to see the lines that are being modified in the file
while it is being edited.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package git-gutter
    :defer 0.3
    :delight
    :init (global-git-gutter-mode +1))
#+END_SRC

Finally, one last package that I like to use with Git to easily see the changes
made by previous commits.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package git-timemachine
   :defer 1
   :delight)
#+END_SRC

** File Explorer ==dired==
   Dired is a major mode for exploring file
   dired-x is a minor that brings a lot to dired like hidding
   - uninteresting file
   - guessing which command to call...
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package dired
    :ensure nil
    :delight "Dired "
    :custom
    (dired-auto-revert-buffer t)
    (dired-dwim-target t)
    (dired-hide-details-hide-symlink-targets nil)
    (dired-omit-files "^\\...+$")
    (dired-omit-mode t)
    (dired-listing-switches "-alh")
    (dired-ls-F-marks-symlinks nil)
    (dired-recursive-copies 'always))

  (use-package dired-x
    :ensure nil )
#+END_SRC
** password-store ==pass==
   Pass helps me to be a bit more secure on my password management
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pass
    :delight "Pass")
#+END_SRC
** IRC ==erc==
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (use-package erc
  ;;   :commands (erc erc-tls)
  ;;   :bind (:map erc-mode-map))
  ;; (use-package erc-join
  ;;  :after erc
  ;;  :custom
  ;;  (erc-autojoin-mode 1)
  ;;  (setq erc-autojoin-channels-alist
  ;;         '(("freenode.net" "#emacs" "#gnus" "#latex" "#freestream"))))
#+END_SRC
