.emacs.d/config.el

(use-package gnus
  :bind (("C-x e" . gnus)
        :map gnus-group-mode-map
        ("C-c C-f" . gnus-summary-mail-forward))
  :custom
  (gnus-fetch-old-headers t))
(use-package w3m
  :after gnus)

(use-package bbdb
  :after gnus)
(use-package bbdb-vcard
  :after bbdb)
;; (use-package vdirel
;;   :custom
;;   (vdirel-repository ~/Contacts))

(use-package magit
   :defer 0.3
   :bind ("C-x g" . magit-status)
)
(use-package git-commit
  :after magit
  :hook (git-commit-mode . my/git-commit-auto-fill-everywhere)
  :custom (git-commit-summary-max-length 50)
  :preface
  (defun my/git-commit-auto-fill-everywhere ()
    "Ensures that the commit body does not exceed 72 characters."
    (setq fill-column 72)
    (setq-local comment-auto-fill-only-comments nil)))

(use-package git-gutter
  :defer 0.3
  :delight
  :init (global-git-gutter-mode +1))

(use-package git-timemachine :defer 1 :delight)

(use-package dired
  :ensure nil
  :delight "Dired "
  :custom
  (dired-auto-revert-buffer t)
  (dired-dwim-target t)
  (dired-hide-details-hide-symlink-targets nil)
  (dired-omit-files "^\\...+$")
  (dired-omit-mode t)
  (dired-listing-switches "-alh")
  (dired-ls-F-marks-symlinks nil)
  (dired-recursive-copies 'always))

(use-package dired-x
  :ensure nil )

(use-package pass
  :delight "Pass ")
